app/Controllers/AuditoriaController.php

    public function index_auditoria()
    {
        $tabla1 =new AuditoriaModel();
        $tabla2 =new UsuariosModel();
        $paginator=$tabla1->pager;
        $query = $tabla1->join('usuarios', 'auditoria.id_usuario = usuarios.id_usuario');
        $data = [
            'auditorias' => $query->findAll(),
            'paginator' => $paginator,
        ];
---
SELECT *
FROM `auditoria`
JOIN `usuarios` ON `auditoria`.`id_usuario` = `usuarios`.`id_usuario`
WHERE `auditoria`.`deleted_at` IS NULL