app/Controllers/ClienteController.php

SELECT *
FROM `series`
WHERE `series`.`deleted_at` IS NULL
 LIMIT 5
SELECT *
FROM `tvshow`
WHERE `tvshow`.`deleted_at` IS NULL
 LIMIT 5
---
	public function index(): string
{
    $tabla1Model = new PeliculasModel();
    $tabla2Model = new SeriesModel();
    $tabla3Model = new TvshowModel();
    // Especifica el número máximo de fondos que deseas mostrar en el slider (por ejemplo, 5)
    $limit = 5;
    $data = [
            'peliculas' => $tabla1Model->findAll($limit),
            'series' => $tabla2Model->findAll($limit),
            'tvshow' => $tabla3Model->findAll($limit)