app/Controllers/Home.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'estivenjc292@gmail.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1
---
	public function login()
	{
		$request = \Config\Services::request();
		$UsuariosModel = new UsuariosModel();
		$usuario = $request->getGet('txtUsuario');
		$clave = $request->getGet('txtClave');
		// Realiza una consulta para buscar el usuario por nombre de usuario
		$usuarioData = $UsuariosModel->where('usuario', $usuario)->first();